app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'staff'
---
    public function index()
    {
        helper('freshbar');

        $productModel = new ProductModel();
        $userModel = new UserModel();
        $stockModel = new StockBatchModel();

        $batches = $stockModel->getWithProducts();

        $fresh = 0;
        $warning = 0;
        $bad = 0;

        foreach ($batches as $batch) {
            $status = \freshness_status($batch['entry_date'], $batch['shelf_life_days']);

            if ($status['status'] === 'Segar') {
                $fresh++;
            } elseif ($status['status'] === 'Tidak Segar') {
                $bad++;
            } else {
                $warning++;
            }
        }

        return view('dashboard/index', [
            'title' => 'Dashboard',
            'totalProducts' => $productModel->countAllResults(),
            'totalStaff' => $userModel->where('role', 'staff')->countAllResults(),