app/Controllers/ProductController.php

    public function index()
    {
        $model = new ProductModel();

        return view('products/index', [
            'title' => 'Data Produk',
            'products' => $model->orderBy('id', 'DESC')->findAll(),
---
SELECT *
FROM `products`
ORDER BY `id` DESC