app/Controllers/StaffController.php

    public function index()
    {
        $model = new UserModel();

        return view('staff/index', [
            'title' => 'Data Staff Gudang',
            'staffs' => $model->where('role', 'staff')->orderBy('id', 'DESC')->findAll(),
---
SELECT *
FROM `users`
WHERE `role` = 'staff'
ORDER BY `id` DESC