app/Models/StockBatchModel.php

SELECT `stock_batches`.*, `products`.`name` AS `product_name`, `products`.`type`, `products`.`unit`, `products`.`shelf_life_days`, `users`.`name` AS `created_by_name`
FROM `stock_batches`
JOIN `products` ON `products`.`id` = `stock_batches`.`product_id`
LEFT JOIN `users` ON `users`.`id` = `stock_batches`.`created_by`
ORDER BY `stock_batches`.`id` DESC
---
    public function getWithProducts($id = null)
    {
        $this->select('
                stock_batches.*,
                products.name AS product_name,
                products.type,
                products.unit,
                products.price,
                products.barcode,
                products.shelf_life_days,
                users.name AS created_by_name
            ')
            ->join('products', 'products.id = stock_batches.product_id')
            ->join('users', 'users.id = stock_batches.created_by', 'left')
            ->orderBy('stock_batches.id', 'DESC');

        if ($id !== null) {
            return $this->where('stock_batches.id', $id)->first();
        }

        return $this->findAll();